Tekla.Structures.Plugins.PluginPropertyFileLocationAttribute
Used to specify file location for a property file.

Tekla.Structures.Plugins.PluginPropertyFileLocationAttribute.#ctor(System.String,System.String)
Initializes a new instance of the Tekla.Structures.Plugins.PluginPropertyFileLocationAttribute class, for a file with provided filename suffix.
suffix: File suffix to register. Must contain the dot, such as ".ExamplePlugin.Data.txt". Should be as specific as possible.
subdirectory: The model folder subdirectory where the attribute should be searched for.
Currently supported values for subdirectory are:
"" - the file is located in the model folder.
"attributes" - the file is located in the model folder's "attributes" subfolder.

Tekla.Structures.Plugins.PluginPropertyFileLocationAttribute.Suffix
Gets the property file suffix.

Tekla.Structures.Plugins.PluginPropertyFileLocationAttribute.Subdirectory
Gets the property file subdirectory in a model folder.